[
    {
        "id": "r001",
        "recipe_img": "https://example.com/recipe001.jpg",
        "recipe_name": "Classic Cheeseburger",
        "ingredients": [
            "ground beef",
            "cheddar cheese",
            "buns",
            "lettuce",
            "tomato",
            "onion"
        ],
        "cooking_method": "1. Divide the beef into patties. 2. Grill or fry the patties until cooked through. 3. Add the cheese to the patties and let it melt. 4. Toast the buns. 5. Add the lettuce, tomato, and onion to the bun. 6. Add the cooked patty with cheese on top. 7. Serve hot.",
        "rating": 4.7
    },
    {
        "id": "r002",
        "recipe_img": "https://example.com/recipe002.jpg",
        "recipe_name": "Mac and Cheese",
        "ingredients": [
            "macaroni",
            "cheddar cheese",
            "milk",
            "butter",
            "flour",
            "breadcrumbs"
        ],
        "cooking_method": "1. Cook the macaroni until al dente. 2. Melt the butter in a saucepan. 3. Add the flour and stir until smooth. 4. Gradually add the milk and stir until smooth. 5. Add the cheese and stir until melted. 6. Mix the macaroni with the cheese sauce. 7. Top with breadcrumbs. 8. Bake until golden brown. 9. Serve hot.",
        "rating": 4.5
    },
    {
        "id": "r003",
        "recipe_img": "https://example.com/recipe003.jpg",
        "recipe_name": "Fried Chicken",
        "ingredients": [
            "chicken",
            "buttermilk",
            "flour",
            "paprika",
            "garlic powder",
            "oil"
        ],
        "cooking_method": "1. Soak the chicken in buttermilk. 2. Mix the flour, paprika, and garlic powder. 3. Dredge the chicken in the flour mixture. 4. Heat the oil in a frying pan. 5. Add the chicken and fry until golden brown. 6. Drain on paper towels. 7. Serve hot.",
        "rating": 4.8
    },
    {
        "id": "r004",
        "recipe_img": "https://example.com/recipe004.jpg",
        "recipe_name": "Chili Con Carne",
        "ingredients": [
            "ground beef",
            "onion",
            "garlic",
            "tomatoes",
            "kidney beans",
            "chili powder"
        ],
        "cooking_method": "1. Cook the ground beef, onion, and garlic in a large pot. 2. Add the tomatoes, kidney beans, and chili powder. 3. Simmer for at least an hour. 4. Serve hot with cornbread or rice.",
        "rating": 4.6
    },
    {
        "id": "r005",
        "recipe_img": "https://example.com/recipe005.jpg",
        "recipe_name": "Buffalo Wings",
        "ingredients": [
            "chicken wings",
            "hot sauce",
            "butter",
            "vinegar",
            "celery",
            "blue cheese dressing"
        ],
        "cooking_method": "1. Deep fry or bake the chicken wings until cooked through. 2. Mix the hot sauce, butter, and vinegar. 3. Toss the wings in the sauce. 4. Serve with celery and blue cheese dressing.",
        "rating": 4.4
    },
    {
        "id": "r006",
        "recipe_img": "https://example.com/recipe006.jpg",
        "recipe_name": "BBQ Ribs",
        "ingredients": [
            "pork ribs",
            "BBQ sauce",
            "brown sugar",
            "paprika",
            "garlic powder",
            "onion powder"
        ],
        "cooking_method": "1. Rub the ribs with a mixture of brown sugar, paprika, garlic powder, and onion powder. 2. Bake the ribs in the oven until almost cooked through. 3. Brush the ribs with BBQ sauce. 4. Grill or broil the ribs until crispy and charred. 5. Serve hot.",
        "rating": 4.9
    },
    {
        "id": "r007",
        "recipe_img": "https://example.com/recipe007.jpg",
        "recipe_name": "New England Clam Chowder",
        "ingredients": [
            "clams",
            "potatoes",
            "bacon",
            "onion",
            "celery",
            "cream"
        ],
        "cooking_method": "1. Cook the clams until they open. 2. Remove the clams from the shells and chop them. 3. Cook the bacon until crispy. 4. Add the onion and celery to the bacon fat and cook until soft. 5. Add the potatoes and enough water to cover. 6. Simmer until the potatoes are tender. 7. Add the chopped clams and cream. 8. Heat until the soup is hot. 9. Serve hot.",
        "rating": 4.7
    },
    {
        "id": "r008",
        "recipe_img": "https://example.com/recipe008.jpg",
        "recipe_name": "Pecan Pie",
        "ingredients": [
            "pie crust",
            "pecans",
            "brown sugar",
            "corn syrup",
            "butter",
            "vanilla extract"
        ],
        "cooking_method": "1. Mix the pecans, brown sugar, corn syrup, butter, and vanilla extract. 2. Pour the mixture into the pie crust. 3. Bake until the filling is set. 4. Cool to room temperature. 5. Serve cold or warm with whipped cream.",
        "rating": 4.5
    },
    {
        "id": "r009",
        "recipe_img": "https://example.com/recipe009.jpg",
        "recipe_name": "Buttermilk Pancakes",
        "ingredients": [
            "flour",
            "buttermilk",
            "eggs",
            "baking powder",
            "baking soda",
            "butter"
        ],
        "cooking_method": "1. Mix the flour, baking powder, and baking soda. 2. Mix the buttermilk, eggs, and melted butter. 3. Mix the wet and dry ingredients until smooth. 4. Heat a griddle or frying pan. 5. Pour the batter onto the griddle or frying pan. 6. Cook until bubbles form on the surface. 7. Flip and cook until golden brown. 8. Serve hot with butter and syrup.",
        "rating": 4.6
    },
    {
        "id": "r010",
        "recipe_img": "https://example.com/recipe010.jpg",
        "recipe_name": "Macaroni and Cheese",
        "ingredients": [
            "macaroni pasta",
            "butter",
            "flour",
            "milk",
            "cheddar cheese",
            "breadcrumbs"
        ],
        "cooking_method": "1. Cook the macaroni pasta according to package instructions. 2. In a separate pot, melt butter over medium heat. 3. Whisk in flour and cook for 2-3 minutes, stirring constantly. 4. Gradually whisk in milk and cook until the sauce thickens. 5. Add cheddar cheese and stir until melted. 6. Combine the cheese sauce with the cooked macaroni pasta. 7. Pour the mixture into a baking dish and top with breadcrumbs. 8. Bake in the oven until the breadcrumbs are golden brown. 9. Serve hot.",
        "rating": 4.8
    },
    {
        "id": "r011",
        "recipe_img": "https://example.com/recipe011.jpg",
        "recipe_name": "Shrimp and Grits",
        "ingredients": [
            "shrimp",
            "grits",
            "bacon",
            "butter",
            "onion",
            "garlic",
            "chicken broth",
            "heavy cream",
            "cheddar cheese",
            "hot sauce"
        ],
        "cooking_method": "1. Cook the grits according to package instructions. 2. Cook the bacon until crispy, remove from the pan and crumble. 3. In the same pan, sauté the onion and garlic until softened. 4. Add the shrimp to the pan and cook until pink. 5. Add chicken broth and bring to a simmer. 6. Add heavy cream and stir. 7. Stir in cheddar cheese until melted. 8. Serve the shrimp and sauce over the grits, and top with crumbled bacon and hot sauce.",
        "rating": 4.9
    },
    {
        "id": "r012",
        "recipe_img": "https://example.com/recipe012.jpg",
        "recipe_name": "Fried Chicken",
        "ingredients": [
            "chicken",
            "buttermilk",
            "flour",
            "cornmeal",
            "paprika",
            "garlic powder",
            "onion powder",
            "salt",
            "pepper",
            "oil"
        ],
        "cooking_method": "1. Soak the chicken in buttermilk for at least an hour. 2. Mix the flour, cornmeal, and spices in a separate bowl. 3. Remove the chicken from the buttermilk and coat with the flour mixture. 4. Heat oil in a frying pan over medium heat. 5. Fry the chicken in the hot oil until crispy and cooked through. 6. Drain the chicken on a paper towel-lined plate. 7. Serve hot.",
        "rating": 4.7
    },
    {
        "id": "r013",
        "recipe_img": "https://example.com/recipe013.jpg",
        "recipe_name": "Chili",
        "ingredients": [
            "ground beef",
            "onion",
            "garlic",
            "tomatoes",
            "kidney beans",
            "chili powder",
            "cumin",
            "salt",
            "pepper"
        ],
        "cooking_method": "1. Cook the ground beef in a large pot over medium-high heat. 2. Add the onion and garlic and cook until softened. 3. Add the tomatoes, kidney beans, chili powder, cumin, salt, and pepper. 4. Bring to a simmer and cook until the flavors have melded and the chili has thickened. 5. Serve hot with your favorite toppings, such as shredded cheese, sour cream, and chopped onions.",
        "rating": 4.5
    },
    {
        "id": "r014",
        "recipe_img": "https://example.com/recipe014.jpg",
        "recipe_name": "Biscuits and Gravy",
        "ingredients": [
            "sausage",
            "flour",
            "milk",
            "butter",
            "salt",
            "pepper",
            "biscuits"
        ],
        "cooking_method": "1. Cook the sausage in a large skillet over medium-high heat. 2. Sprinkle flour over the sausage and stir until coated. 3. Gradually whisk in milk and bring to a simmer. 4. Add butter, salt, and pepper to taste. 5. Cook until the gravy has thickened. 6. Serve the gravy over warm biscuits.",
        "rating": 4.5
    },
    {
        "id": "r015",
        "recipe_img": "https://example.com/recipe015.jpg",
        "recipe_name": "Fried Catfish",
        "ingredients": [
            "catfish fillets",
            "buttermilk",
            "cornmeal",
            "flour",
            "paprika",
            "garlic powder",
            "onion powder",
            "salt",
            "pepper",
            "oil"
        ],
        "cooking_method": "1. Soak the catfish in buttermilk for at least an hour. 2. Mix the cornmeal, flour, and spices in a separate bowl. 3. Remove the catfish from the buttermilk and coat with the cornmeal mixture. 4. Heat oil in a frying pan over medium heat. 5. Fry the catfish in the hot oil until crispy and cooked through. 6. Drain the catfish on a paper towel-lined plate. 7. Serve hot with lemon wedges and tartar sauce.",
        "rating": 4.8
    },
    {
        "id": "r016",
        "recipe_img": "https://example.com/recipe016.jpg",
        "recipe_name": "Meatloaf",
        "ingredients": [
            "ground beef",
            "breadcrumbs",
            "onion",
            "milk",
            "egg",
            "ketchup",
            "mustard",
            "Worcestershire sauce",
            "salt",
            "pepper"
        ],
        "cooking_method": "1. Preheat the oven to 350°F. 2. Mix the ground beef, breadcrumbs, onion, milk, egg, ketchup, mustard, Worcestershire sauce, salt, and pepper in a large bowl. 3. Shape the mixture into a loaf and place in a baking dish. 4. Bake for 1 hour or until cooked through. 5. Let the meatloaf rest for 10 minutes before slicing and serving.",
        "rating": 4.6
    },
    {
        "id": "r017",
        "recipe_img": "https://example.com/recipe017.jpg",
        "recipe_name": "Jambalaya",
        "ingredients": [
            "andouille sausage",
            "chicken",
            "onion",
            "green bell pepper",
            "celery",
            "garlic",
            "tomatoes",
            "rice",
            "chicken broth",
            "bay leaves",
            "thyme",
            "paprika",
            "cayenne pepper",
            "salt",
            "pepper"
        ],
        "cooking_method": "1. Cook the andouille sausage and chicken in a large pot over medium-high heat. 2. Add the onion, green bell pepper, celery, and garlic and cook until softened. 3. Add the tomatoes, rice, chicken broth, bay leaves, thyme, paprika, cayenne pepper, salt, and pepper. 4. Bring to a boil, then reduce the heat and simmer until the rice is cooked through. 5. Serve hot.",
        "rating": 4.7
    },
    {
        "id": "r019",
        "recipe_img": "https://example.com/recipe019.jpg",
        "recipe_name": "Pulled Pork",
        "ingredients": [
            "pork shoulder",
            "brown sugar",
            "paprika",
            "garlic powder",
            "onion powder",
            "cumin",
            "chili powder",
            "salt",
            "pepper",
            "barbecue sauce"
        ],
        "cooking_method": "1. Combine the brown sugar, paprika, garlic powder, onion powder, cumin, chili powder, salt, and pepper in a small bowl. 2. Rub the mixture all over the pork shoulder. 3. Place the pork shoulder in a slow cooker and cook on low for 8-10 hours, until the meat is tender and falls apart easily. 4. Remove the pork from the slow cooker and shred with two forks. 5. Toss the shredded pork with barbecue sauce to taste. 6. Serve hot on buns with coleslaw, if desired.",
        "rating": 4.9
    },
    {
        "id": "r020",
        "recipe_img": "https://example.com/recipe020.jpg",
        "recipe_name": "Fried Chicken",
        "ingredients": [
            "chicken",
            "buttermilk",
            "flour",
            "cornstarch",
            "paprika",
            "garlic powder",
            "onion powder",
            "salt",
            "pepper",
            "oil"
        ],
        "cooking_method": "1. Soak the chicken in buttermilk for at least an hour. 2. Mix the flour, cornstarch, and spices in a separate bowl. 3. Remove the chicken from the buttermilk and coat with the flour mixture. 4. Heat oil in a frying pan over medium-high heat. 5. Fry the chicken in the hot oil until crispy and cooked through. 6. Drain the chicken on a paper towel-lined plate. 7. Serve hot with your favorite dipping sauce.",
        "rating": 4.7
    },
    {
        "id": "r021",
        "recipe_img": "https://example.com/recipe021.jpg",
        "recipe_name": "Clam Chowder",
        "ingredients": [
            "clams",
            "potatoes",
            "onion",
            "celery",
            "bacon",
            "heavy cream",
            "butter",
            "flour",
            "salt",
            "pepper",
            "bay leaf",
            "thyme"
        ],
        "cooking_method": "1. Cook the bacon in a large pot over medium heat until crisp. 2. Remove the bacon and set aside. 3. Add the onion and celery to the pot and cook until softened. 4. Add the flour and cook for 1-2 minutes, stirring constantly. 5. Add the potatoes, clams, clam juice, bay leaf, thyme, salt, and pepper. 6. Bring to a boil, then reduce the heat and simmer until the potatoes are cooked through. 7. Remove the bay leaf and stir in the heavy cream and butter. 8. Serve hot, topped with crumbled bacon.",
        "rating": 4.8
    }
]